package ru.liga.prerevolutionarytindertranslator.repository.impl;

import org.springframework.stereotype.Repository;
import ru.liga.prerevolutionarytindertranslator.repository.ListRepository;

import java.util.Set;

@Repository
public class ListRepositoryImpl implements ListRepository {
    private static final Set<String> NAMES = Set.of("Агафья", "Анфимъ", "Афанасій", "Афина", "Варфоломей",
            "Голіафъ", "Евфимій", "Марфа", "Матфей", "Мефодій", "Нафанаилъ", "Парфенонъ", "Пифагоръ", "Руфь", "Саваофъ",
            "Тимофей", "Эсфирь", "Іудифь", "Фаддей", "Фекла", "Фемида", "Фемистоклъ", "Феодоръ", "Фёдоръ", "Федя",
            "Феодосій", "Федосій", "Феодосія", "Феодотъ", "Федотъ", "Феофанъ", "Феофилъ", "Ферапонтъ", "Фома",
            "Фоминична");

    private static final Set<String> ROOTS = Set.of("еда", "ем", "ест", "обед", "сыроеж", "сыроег", "медвед", "снед",
            "едк", "ех", "езд", "еду", "бег", "беж", "бед", "побед", "убед", "убежд", "бел", "бес", "беш",
            "обет", "обещ", "вея", "вее", "вех", "вед", "вест", "веж", "век", "веч", "вен", "вер", "вес", "веш",
            "звезд", "звер", "невест", "вет", "вещ", "свеж", "свет", "свеч", "свещ", "цвет", "цвест", "челове",
            "дет", "дев", "дея", "дел", "действ", "дед", "зев", "зей", "зело", "зен", "лев", "лез",
            "лестниц", "лек", "леч", "лен", "леп", "лес", "леш", "лет", "лех", "блед", "желез", "калек", "калеч",
            "клет", "колен", "леле", "мле", "плен", "плесен", "плеш", "плех", "полен", "след", "слеп", "телег", "тележ",
            "тлен", "хлеб" , "хлев", "мед", "мел", "мен", "мер", "меся", "мес", "меш", "помех", "мест", "мещ", "мет",
            "меч", "мех", "зме", "сме", "нег", "неж", "недр", "нем", "нет", "нек", "гнев", "гнед", "гнезд",
            "загнет", "снег", "снеж", "мнен", "мнев", "пет", "песн", "пег", "пен", "пест", "пех", "пеш", "спех", "спеш",
            "рея", "рек", "реч", "ред", "рез", "реп", "рес", "обрет", "обрес", "сретен", "встреч", "рех", "реш", "грех",
            "греш", "зре", "креп", "орех", "пре", "прес", "свире", "стрел", "стрех", "хрен", "сусек", "сея", "сем",
            "север", "сед", "сест", "сек", "сеч", "сен", "сер", "сет", "сещ", "стен", "тел", "тен", "тес", "тея", "тех",
            "теш", "хер", "цев", "цед", "цел", "цен", "цеп");

    @Override
    public Set<String> getAllNames() {
        return NAMES;
    }

    @Override
    public Set<String> getAllRoots() {
        return ROOTS;
    }
}
